Config/Enums/ВидыКБК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыКБК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>гКБК</Name>
					<Comment>Глава по БК</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КРБ</Name>
					<Comment>Классификация расходов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КДБ</Name>
					<Comment>Классификация доходов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КИФ</Name>
					<Comment>Классификация источников финансирования дефицита бюджетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУИБУ</Name>
					<Comment>Для АУ и БУ начиная с 01.01.2017</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/СтатьиПланаПоступленийВыбытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтатьиПланаПоступленийВыбытий</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПланыПоступленийВыбытий</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АналитическаяГруппаКДБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитическаяГруппаКИФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитическийКодКПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АналитическиеКодыКПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоходаКДБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовКДБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИзмененияОстатковСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИзмененияОстатковСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКИФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасходаКРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРасходовКРБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПодвидаКДБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПодвидовКДБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПодгруппаКИФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПодгруппыКИФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОСГУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>700</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаЦелевойСтатьиКРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыЦелевыхСтатейКРБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделПодразделКРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыПодразделыКРБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКИФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиКИФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелеваяСтатьяКРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелевыеСтатьиКРБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ВидыДоходовКДБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыДоходовКДБ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подгруппа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подстатья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Элемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АналитическиеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АналитическаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/СтатьиКИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтатьиКИФ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ГруппыПодгруппыКИФ</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Элемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопустимыеКОСГУ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КОСГУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ГруппыПодгруппыКИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГруппыПодгруппыКИФ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Элемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопустимыеКОСГУ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КОСГУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/ПлановыеПоказателиДеятельности/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЛАНОВЫЕ ПОКАЗАТЕЛИ ДЕЯТЕЛЬНОСТИ
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает код статьи плана.
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура, Структура - содержит значения компонентов статьи плана.
//  ВидСтатьи - ПеречислениеСсылка.ВидыКБК.
//
// Возвращаемое значение:
//  Строка - код статьи плана (20 или 17 знаков), определенный по кодам компонентов.
//  
// Устанавливаемые значения:
//  НовоеНаименование - Строка - наименование статьи плана, определенное по компонентам.
//  ДатаНачала - Дата - Дата начала действия статьи,определенная по дате действия компонентов.
//  ДатаОкончания  - Дата - Дата окончания действия статьи,определенная по дате действия компонентов.
//
Функция НовыйКодСтатьи(Объект, ДатаНачала = Неопределено, ДатаОкончания = Неопределено, НовоеНаименование = "", ВидСтатьи, УточнениеСтатьи = Неопределено) Экспорт
	
	Перем МассивСвойств, МассивДлин, МассивИмен, ЗначениеКОСГУ, ТекущийКод;
	
	ЧастиКода = Новый ТаблицаЗначений;
	ЧастиКода.Колонки.Добавить("Значение");
	ЧастиКода.Колонки.Добавить("Длина");
	
	Если Объект.Свойство("Код") Тогда
		ТекущийКод = "Код";
	ИначеЕсли Объект.Свойство("Наименование") Тогда
		ТекущийКод = "Наименование";
	Иначе
		ТекущийКод = "";
	КонецЕсли;	
	
	Если Объект.Свойство("ДатаНачалаДействия") Тогда
		ОбъектДатаНачала = Объект.ДатаНачалаДействия;
	ИначеЕсли Объект.Свойство("ДатаНачала") Тогда
		ОбъектДатаНачала = Объект.ДатаНачала;
	Иначе
		ОбъектДатаНачала = ТекущаяДатаСеанса();
	КонецЕсли;	
	
	СоставРеквизитовКодаСтатьи(ВидСтатьи, МассивСвойств, МассивДлин, МассивИмен, ТекущийКод, ОбъектДатаНачала, УточнениеСтатьи);
	
	Если МассивСвойств.Количество() > 0 Тогда
		
		Для Инд = 0 По МассивСвойств.Количество() - 1 Цикл
			НоваяСтр = ЧастиКода.Добавить();
			НоваяСтр.Значение = ?(ЗначениеЗаполнено(МассивСвойств[Инд]), Объект[МассивСвойств[Инд]], "");
			НоваяСтр.Длина = МассивДлин[Инд];
		КонецЦикла;
		
		НоваяСтр = ЧастиКода.Добавить();

		Если Объект.Свойство("КОСГУ", ЗначениеКОСГУ) Тогда
			НоваяСтр.Значение = ЗначениеКОСГУ;
			НоваяСтр.Длина = 3;
		Иначе
			НоваяСтр.Значение = "";
			НоваяСтр.Длина = 0;
		КонецЕсли;	
	
	КонецЕсли;
	
	ОпределитьПериодДействияСтатьиПоКомпонентам(ЧастиКода, ДатаНачала, ДатаОкончания);
	
	НовоеНаименование = ВычислитьНовоеНаименование(ЧастиКода, МассивИмен, ВидСтатьи);
	
	Возврат ВычислитьНовыйКод(ЧастиКода);
	
КонецФункции

Функция ВычислитьНовыйКод(ЧастиКода) Экспорт
	
	НовыйКод = "00000000000000000000";
	
	Если ЧастиКода.Количество() > 0 Тогда
		
		НовыйКод = "";
		
		Для Каждого Стр Из ЧастиКода Цикл
			НовыйКод = НовыйКод + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Лев(Стр.Значение, Стр.Длина), Стр.Длина);
		КонецЦикла;	
		
	КонецЕсли;	
	
	Возврат НовыйКод
	
КонецФункции

Процедура СоставРеквизитовКодаСтатьи(ВидСтатьи, МассивСвойств, МассивДлин, МассивИмен, ТекущийКод, ДатаНачала, УточнениеСтатьи = Неопределено) Экспорт
	
	ИмяГлавыПоБК = "Глава";
	
	МассивСвойств 	= Новый Массив;
	МассивДлин 		= Новый Массив;
	МассивИмен 		= Новый Массив;
	
	Если ВидСтатьи = Перечисления.ВидыКБК.гКБК Тогда
		
		МассивСвойств.Добавить("");
		
		МассивДлин.Добавить(17);
		
		МассивИмен.Добавить(0);
			
	ИначеЕсли ВидСтатьи = Перечисления.ВидыКБК.КДБ Тогда
		
		МассивСвойств.Добавить("ВидДоходаКДБ");
		МассивСвойств.Добавить("ГруппаПодвидаКДБ");
		МассивСвойств.Добавить("АналитическаяГруппаКДБ");
		
		МассивДлин.Добавить(10);
		МассивДлин.Добавить(4);
		МассивДлин.Добавить(3);
		
		МассивИмен.Добавить(0);
		МассивИмен.Добавить(1);
		МассивИмен.Добавить(2);
		
	ИначеЕсли ВидСтатьи = Перечисления.ВидыКБК.КРБ Тогда
		
		МассивСвойств.Добавить("РазделПодразделКРБ");
		МассивСвойств.Добавить("ЦелеваяСтатьяКРБ");
		МассивСвойств.Добавить("ПрограммаЦелевойСтатьиКРБ");
		МассивСвойств.Добавить("ВидРасходаКРБ");
		
		МассивДлин.Добавить(4); 		// РЗПР
		МассивДлин.Добавить(5); 		// Программа, подпрограмма, основное мероприятие
		МассивДлин.Добавить(5); 		// Направление расходов
		МассивДлин.Добавить(3); 		// Вид расходов
		
		МассивИмен.Добавить(0);
        МассивИмен.Добавить(1);
		МассивИмен.Добавить(2);
		МассивИмен.Добавить(3);
        МассивИмен.Добавить(4);
		
	ИначеЕсли ВидСтатьи = Перечисления.ВидыКБК.КИФ Тогда
		
		МассивСвойств.Добавить("ГруппаПодгруппаКИФ");
		МассивСвойств.Добавить("СтатьяКИФ");
		МассивСвойств.Добавить("ВидКИФ"); 
		МассивСвойств.Добавить("АналитическаяГруппаКИФ");

		
		МассивДлин.Добавить(4);
		МассивДлин.Добавить(6);
		МассивДлин.Добавить(4);
		МассивДлин.Добавить(3);

		МассивИмен.Добавить(0);
        МассивИмен.Добавить(1);
		МассивИмен.Добавить(2);
		МассивИмен.Добавить(3);
		
	ИначеЕсли ВидСтатьи = Перечисления.ВидыКБК.АУИБУ Тогда
		
		МассивСвойств.Добавить("РазделПодразделКРБ");
		МассивСвойств.Добавить("АналитическийКодКПС");
		
		Если УточнениеСтатьи = Перечисления.ВидыКБК.КРБ Тогда
			МассивСвойств.Добавить("ВидРасходаКРБ");
		ИначеЕсли УточнениеСтатьи = Перечисления.ВидыКБК.КДБ Тогда
			МассивСвойств.Добавить("АналитическаяГруппаКДБ");
		Иначе
			МассивСвойств.Добавить("АналитическаяГруппаКИФ");
	    КонецЕсли;
		
		МассивДлин.Добавить(4);
		МассивДлин.Добавить(10);
		МассивДлин.Добавить(3);
		
		МассивИмен.Добавить(0);
        МассивИмен.Добавить(1);
		МассивИмен.Добавить(2);
		
	ИначеЕсли ВидСтатьи = Перечисления.ВидыКБК.Произвольный Тогда
		
		МассивСвойств.Добавить(ТекущийКод);  
		
		МассивДлин.Добавить(17);
		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьНовыйКодСтатьи(Объект, ВидСтатьи, УточнениеСтатьи = Неопределено) Экспорт
	
	Перем МассивСвойств, МассивДлин, МассивИмен, ЗначениеКОСГУ, ТекущийКод;
	
	ЧастиКода = Новый ТаблицаЗначений;
	ЧастиКода.Колонки.Добавить("Значение");
	ЧастиКода.Колонки.Добавить("Длина");
	
	Если Объект.Свойство("Код") Тогда
		ТекущийКод = "Код";
	ИначеЕсли Объект.Свойство("Наименование") Тогда
		ТекущийКод = "Наименование";
	Иначе
		ТекущийКод = "";
	КонецЕсли;	
	
	Если Объект.Свойство("ДатаНачалаДействия") Тогда
		ОбъектДатаНачала = Объект.ДатаНачалаДействия;
	ИначеЕсли Объект.Свойство("ДатаНачала") Тогда
		ОбъектДатаНачала = Объект.ДатаНачала;
	Иначе
		ОбъектДатаНачала = ТекущаяДатаСеанса();
	КонецЕсли;	
	
	СоставРеквизитовКодаСтатьи(ВидСтатьи, МассивСвойств, МассивДлин, МассивИмен, ТекущийКод, ОбъектДатаНачала, УточнениеСтатьи);
	
	Если МассивСвойств.Количество() > 0 Тогда
		
		Для Инд = 0 По МассивСвойств.Количество() - 1 Цикл
			НоваяСтр = ЧастиКода.Добавить();
			НоваяСтр.Значение = ?(ЗначениеЗаполнено(МассивСвойств[Инд]), Объект[МассивСвойств[Инд]], "");
			НоваяСтр.Длина = МассивДлин[Инд];
		КонецЦикла;
		
		НоваяСтр = ЧастиКода.Добавить();

		Если Объект.Свойство("КОСГУ", ЗначениеКОСГУ) Тогда
			НоваяСтр.Значение = ЗначениеКОСГУ;
			НоваяСтр.Длина = 3;
		Иначе
			НоваяСтр.Значение = "";
			НоваяСтр.Длина = 0;
		КонецЕсли;	
	
	КонецЕсли;
			
	Возврат ВычислитьНовыйКод(ЧастиКода);
	
КонецФункции

// Определяет соответсвие составных частей классификатора Доходов, КИФ выбранному
// значению составной части (ГруппаПодгруппа, СтатьяПодстатья, Вид, Подвид).
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура, Структура - содержит значения компонентов статьи плана.
//  ВидСтатьи - ПеречислениеСсылка.ВидыКБК.
//  ТекущиеЗначения - Массив - содержит ссылки на составные части классификатора(ГруппаПодгруппа,
//  	СтатьяПодстатья, Вид, Подвид). Последовательность элементов должна соответствовать 
//      логической последовательности составных частей классификатора
//  ИндексВыбранного - Число - Индекс массива составных частей классификатора, указывающий 
//		"место", котрое должно занять ВыбранноеЗначение      
//  ВыбранноеЗначение - СправочникСсылка - ссылка на выбранную составную часть классификатора
//
// Возвращаемое значение:
//  Массив -  содержит ссылки на составные части классификатора(ГруппаПодгруппа,
//  	СтатьяПодстатья, Вид, Подвид) определенные по значению ссылки "ВыбранноеЗначение" 
//  
// Устанавливаемые значения:
//  НовоеНаименование - Строка - наименование статьи плана, определенное по компонентам.
//  ДатаНачала - Дата - Дата начала действия статьи,определенная по дате действия компонентов.
//  ДатаОкончания  - Дата - Дата окончания действия статьи,определенная по дате действия компонентов.
//  НовыйКод - Строка - код статьи плана (20 или 17 знаков), определенный по кодам компонентов.
//
Функция ПолучитьЗначенияСвязанныхРеквизитов(ТекущиеЗначения, 
											ИндексВыбранного, 
											ВыбранноеЗначение, 
											Объект, 
											НовыйКод, 
											ДатаНачала = Неопределено, 
											ДатаОкончания = Неопределено, 
											НовоеНаименование = "", 
											ВидСтатьи,
											ИмяГлавыПоБК = "Глава") Экспорт

	Перем МассивСвойств, МассивДлин, МассивИмен, ЗначениеКОСГУ;
    	
	НовыеЗначения = Новый Массив(ТекущиеЗначения.Количество());
	НовыеЗначения[ИндексВыбранного] = ВыбранноеЗначение;
	
	// Установим владельца
	ИндексЗначения = ИндексВыбранного;
	ЗначениеЭлемента = ВыбранноеЗначение;
	Пока ИндексЗначения > 0 Цикл
		ИндексЗначения = ИндексЗначения - 1;
		НовыеЗначения[ИндексЗначения] = ЗначениеЭлемента.Владелец;
		ЗначениеЭлемента = НовыеЗначения[ИндексЗначения];
	КонецЦикла;
	
	// Проверим подчиненных
	ЗначениеЭлемента = ВыбранноеЗначение;
	Для ИндексЗначения = ИндексВыбранного + 1 По ТекущиеЗначения.ВГраница() Цикл
		Если ТекущиеЗначения[ИндексЗначения].Владелец = ЗначениеЭлемента Тогда
			НовыеЗначения[ИндексЗначения] = ТекущиеЗначения[ИндексЗначения];
		ИначеЕсли ТипЗнч(ЗначениеЭлемента) = Тип("СправочникСсылка.ВидыКИФ")
			И ТипЗнч(ТекущиеЗначения[ИндексЗначения]) = Тип("СправочникСсылка.КОСГУ") Тогда
			//при выборе вида киф из классификатора не заполнялась ан.группа
			НовыеЗначения[ИндексЗначения] = ТекущиеЗначения[ИндексЗначения];
		КонецЕсли;
		ЗначениеЭлемента = НовыеЗначения[ИндексЗначения]; 
	КонецЦикла;	
	
	// Сформируем новый код
	
	Если Объект.Свойство("ДатаНачалаДействия") Тогда
		ОбъектДатаНачала = Объект.ДатаНачалаДействия;
	ИначеЕсли Объект.Свойство("ДатаНачала") Тогда
		ОбъектДатаНачала = Объект.ДатаНачала;
	Иначе
		ОбъектДатаНачала = ТекущаяДатаСеанса();
	КонецЕсли;	
	
	ЧастиКода = Новый ТаблицаЗначений;
	ЧастиКода.Колонки.Добавить("Значение");
	ЧастиКода.Колонки.Добавить("Длина");
	
	СоставРеквизитовКодаСтатьи(ВидСтатьи, МассивСвойств, МассивДлин, МассивИмен, "", ОбъектДатаНачала);
	
	Если ОбъектДатаНачала < Дата(2016, 1, 1) Тогда
		НоваяСтр = ЧастиКода.Добавить();
		НоваяСтр.Значение = Объект[ИмяГлавыПоБК];
		НоваяСтр.Длина = 3;
		
		Для Инд = 1 По МассивСвойств.Количество() - 1 Цикл
			НоваяСтр = ЧастиКода.Добавить();
			НоваяСтр.Значение = НовыеЗначения[Инд - 1];
			НоваяСтр.Длина = МассивДлин[Инд];
		КонецЦикла;	
		
	Иначе
		
		Для Инд = 0 По МассивСвойств.Количество() - 1 Цикл
			НоваяСтр = ЧастиКода.Добавить();
			НоваяСтр.Значение = НовыеЗначения[Инд];
			НоваяСтр.Длина = МассивДлин[Инд];
		КонецЦикла;	
		
	КонецЕсли;
   
	НоваяСтр = ЧастиКода.Добавить();
	Если Объект.Свойство("КОСГУ", ЗначениеКОСГУ) Тогда
		НоваяСтр.Значение = ЗначениеКОСГУ;
		НоваяСтр.Длина = 3;
	Иначе
		НоваяСтр.Значение = "";
		НоваяСтр.Длина = 0;
	КонецЕсли;	
 	
	ОпределитьПериодДействияСтатьиПоКомпонентам(ЧастиКода, ДатаНачала, ДатаОкончания);

	НовыйКод = ВычислитьНовыйКод(ЧастиКода);
	
	НовоеНаименование = ВычислитьНовоеНаименование(ЧастиКода, МассивИмен, ВидСтатьи);
	
	Возврат НовыеЗначения;

КонецФункции

// Определяет соответсвие составных частей классификатора Целевых статей выбранному
// значению составной части (ЦелеваяСтатья, Программа, Подпрограмма).
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура, Структура - содержит значения компонентов статьи плана.
//  ВидСтатьи - ПеречислениеСсылка.ВидыКБК.
//  ТекущиеЗначения - Массив - содержит ссылки на составные части классификатора(ЦелеваяСтатья,
//  	Программа, Подпрограмма). Последовательность элементов должна соответствовать 
//      логической последовательности составных частей классификатора
//  ИндексВыбранного - Число - Индекс массива составных частей классификатора, указывающий 
//		"место", котрое должно занять ВыбранноеЗначение      
//  ВыбранноеЗначение - СправочникСсылка - ссылка на выбранную составную часть классификатора
//
// Возвращаемое значение:
//  Массив -  содержит ссылки на составные части классификатора(ЦелеваяСтатья,
//  	Программа) определенные по значению ссылки "ВыбранноеЗначение" 
//  
// Устанавливаемые значения:
//  НовоеНаименование - Строка - наименование статьи плана, определенное по компонентам.
//  ДатаНачала - Дата - Дата начала действия статьи,определенная по дате действия компонентов.
//  ДатаОкончания  - Дата - Дата окончания действия статьи,определенная по дате действия компонентов.
//  НовыйКод - Строка - код статьи плана (20 или 17 знаков), определенный по кодам компонентов.
// Технический проект 00-00017603
Функция ПолучитьЗначенияСвязанныхРеквизитовЦСР( ТекущиеЗначения, 
												ИндексВыбранного, 
												ВыбранноеЗначение, 
												Объект, 
												НовыйКод, 
												ДатаНачала = Неопределено, 
												ДатаОкончания = Неопределено, 
												НовоеНаименование = "", 
												ВидСтатьи) Экспорт

	Перем МассивСвойств, МассивДлин, МассивИмен, ЗначениеКОСГУ;
    	
	НовыеЗначения = Новый Массив(ТекущиеЗначения.Количество());
	НовыеЗначения[ИндексВыбранного] = ВыбранноеЗначение;
	
	Если ИндексВыбранного = 0 Тогда //Выбрали статью
		
		Если ЗначениеЗаполнено(ТекущиеЗначения[1]) И (ТекущиеЗначения[1].ЦелеваяСтатья = ВыбранноеЗначение ИЛИ  ТекущиеЗначения[1].ЦелеваяСтатья.Пустая()) Тогда
			НовыеЗначения[1] = ТекущиеЗначения[1];
        КонецЕсли;
		
	Иначе	
		// Установим владельца
		ИндексЗначения = ИндексВыбранного;
		ЗначениеЭлемента = ВыбранноеЗначение;
		Пока ИндексЗначения > 1 Цикл
			ИндексЗначения = ИндексЗначения - 1;
			НовыеЗначения[ИндексЗначения] = ЗначениеЭлемента.Владелец;
			ЗначениеЭлемента = НовыеЗначения[ИндексЗначения];
		КонецЦикла;
		// Проверим подчиненных
		ЗначениеЭлемента = ВыбранноеЗначение;
		Для ИндексЗначения = ИндексВыбранного + 1 По ТекущиеЗначения.ВГраница() Цикл
			Если ТекущиеЗначения[ИндексЗначения].Владелец = ЗначениеЭлемента Тогда
				НовыеЗначения[ИндексЗначения] = ТекущиеЗначения[ИндексЗначения];
			КонецЕсли;
			ЗначениеЭлемента = НовыеЗначения[ИндексЗначения]; 
		КонецЦикла;	
		
		Если ЗначениеЗаполнено(НовыеЗначения[1]) И ЗначениеЗаполнено(НовыеЗначения[1].ЦелеваяСтатья) Тогда
			НовыеЗначения[0] = НовыеЗначения[1].ЦелеваяСтатья;
		Иначе
			НовыеЗначения[0] = ТекущиеЗначения[0];
		КонецЕсли;	
		
	КонецЕсли;
	
	// Сформируем новый код
	
	Если Объект.Свойство("ДатаНачалаДействия") Тогда
		ОбъектДатаНачала = Объект.ДатаНачалаДействия;
	ИначеЕсли Объект.Свойство("ДатаНачала") Тогда
		ОбъектДатаНачала = Объект.ДатаНачала;
	Иначе
		ОбъектДатаНачала = ТекущаяДатаСеанса();
	КонецЕсли;	
 	
	ЧастиКода = Новый ТаблицаЗначений;
	ЧастиКода.Колонки.Добавить("Значение");
	ЧастиКода.Колонки.Добавить("Длина");
	
	СоставРеквизитовКодаСтатьи(ВидСтатьи, МассивСвойств, МассивДлин, МассивИмен, "", ОбъектДатаНачала);
	
	ИндНач = 1;
	ИндКон = 2;
	
	НоваяСтр = ЧастиКода.Добавить();
	НоваяСтр.Значение = Объект.РазделПодразделКРБ;
	НоваяСтр.Длина = 4;

	Для Инд = ИндНач По МассивСвойств.Количество() - ИндКон Цикл
		НоваяСтр = ЧастиКода.Добавить();
		НоваяСтр.Значение = НовыеЗначения[Инд - ИндНач];
		НоваяСтр.Длина = МассивДлин[Инд];
	КонецЦикла;	
	
	НоваяСтр = ЧастиКода.Добавить();
	НоваяСтр.Значение = Объект.ВидРасходаКРБ;
	НоваяСтр.Длина = 3;
       
    НоваяСтр = ЧастиКода.Добавить();
	Если Объект.Свойство("КОСГУ", ЗначениеКОСГУ) Тогда
		НоваяСтр.Значение = ЗначениеКОСГУ;
		НоваяСтр.Длина = 3;
	Иначе
		НоваяСтр.Значение = "";
		НоваяСтр.Длина = 0;
	КонецЕсли;	
	
	ОпределитьПериодДействияСтатьиПоКомпонентам(ЧастиКода, ДатаНачала, ДатаОкончания);

	НовыйКод = ВычислитьНовыйКод(ЧастиКода);
	
	НовоеНаименование = ВычислитьНовоеНаименование(ЧастиКода, МассивИмен, ВидСтатьи);
	
	Возврат НовыеЗначения;

КонецФункции

// Преобразует объект в структуру
//
// Парметры:
//  Объект  - СправочникОбъект
//
// Возвращаемое значение:
// Структура, ключ - имя реквизита справочника, значение - значение реквизита
// 
Функция ОбъектВСтруктуру(Объект) Экспорт
	
	СтруктураОбъекта = Новый Структура;

	Для Каждого Реквизит Из Объект.Метаданные().Реквизиты Цикл
		
		СтруктураОбъекта.Вставить(Реквизит.Имя, Объект[Реквизит.Имя]);
		
	КонецЦикла;	
	
	Для Каждого Реквизит Из Объект.Метаданные().СтандартныеРеквизиты Цикл
		
		СтруктураОбъекта.Вставить(Реквизит.Имя, Объект[Реквизит.Имя]);
		
	КонецЦикла;	

		
	Возврат СтруктураОбъекта;
	
КонецФункции

Функция СтруктураПоказателя(ВидБК, УточнениеБК) Экспорт
	
	СтруктураБК = Неопределено;
	
	Если ВидБК = Перечисления.ВидыКБК.гКБК Тогда
		
		СтруктураБК = Новый Структура("Код");
		
	ИначеЕсли ВидБК = Перечисления.ВидыКБК.КДБ Тогда
		
		СтруктураБК = Новый Структура("ВидДоходаКДБ, ГруппаПодвидаКДБ, АналитическаяГруппаКДБ");
		
	ИначеЕсли ВидБК = Перечисления.ВидыКБК.КИФ Тогда
		
		СтруктураБК = Новый Структура("ГруппаПодгруппаКИФ, СтатьяКИФ, ВидКИФ, АналитическаяГруппаКИФ");
		
	ИначеЕсли ВидБК = Перечисления.ВидыКБК.КРБ Тогда
		
		СтруктураБК = Новый Структура("РазделПодразделКРБ, ЦелеваяСтатьяКРБ, ПрограммаЦелевойСтатьиКРБ, ВидРасходаКРБ");
		
	ИначеЕсли ВидБК = Перечисления.ВидыКБК.АУИБУ И 	УточнениеБК = Перечисления.ВидыКБК.КРБ Тогда
		
		СтруктураБК = Новый Структура("РазделПодразделКРБ, АналитическийКодКПС, ВидРасходаКРБ");
		
	ИначеЕсли ВидБК = Перечисления.ВидыКБК.АУИБУ И 	УточнениеБК = Перечисления.ВидыКБК.КДБ Тогда
		
		СтруктураБК = Новый Структура("РазделПодразделКРБ, АналитическийКодКПС, АналитическаяГруппаКДБ");
		
	ИначеЕсли ВидБК = Перечисления.ВидыКБК.АУИБУ И 	УточнениеБК = Перечисления.ВидыКБК.КИФ Тогда
		
		СтруктураБК = Новый Структура("РазделПодразделКРБ, АналитическийКодКПС, АналитическаяГруппаКИФ");
		
	ИначеЕсли ВидБК =  Перечисления.ВидыКБК.Произвольный Тогда
		
		СтруктураБК = Новый Структура("Код")
		
	КонецЕсли;  
	
	Если НЕ  СтруктураБК = Неопределено Тогда 
		
		СтруктураБК.Вставить("ДатаНачалаДействия",);
		СтруктураБК.Вставить("ДатаОкончанияДействия",);
		
		// ДЛЯ СОВМЕСТИМОСТИ С БГУ 1.0 добавим свойство "ППП"
		Если СтруктураБК.Свойство("Глава") Тогда
			СтруктураБК.Вставить("ППП", СтруктураБК.Глава);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураБК; 
	
КонецФункции	
	
// Функция извлекает ссылки на компоненты КБК из элемента справочника
// СтатьиПланаПоступленийВыбытий.
//
// Параметры:
//  СтатьяПлана  - СправочникСсылка.СтатьиПланаПоступленийВыбытий,
//                 элемент из которого извлекаются значения.
//
// Возврващаемое значение:
//  ФиксированнаяСтруктура, имена свойств соответствуют именам реквизитов
//                 справочника КПС (КБК) и СтатьиПланаПоступленийВыбытий.
//
// Устанавливаемые значения:
//  ВидБК	- ПеречислениеСсылка.ВидыКБК, вид показателя плана, для статьи
//            которого определяются значения БК.
//  Бюджет  - СправочникСсылка.Бюджеты, бюджет плана, для статьи
//            которого определяются значения БК.
//
Функция ОпределитьКомпонентыБКСтатьиПлана(Знач СтатьяПлана, ВидБК = Неопределено, Бюджет = Неопределено, УточнениеБК = Неопределено) Экспорт
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СтатьиПланаПоступленийВыбытий.РазделПодразделКРБ,
	|	СтатьиПланаПоступленийВыбытий.ЦелеваяСтатьяКРБ,
	|	СтатьиПланаПоступленийВыбытий.ПрограммаЦелевойСтатьиКРБ,
	|	СтатьиПланаПоступленийВыбытий.ВидРасходаКРБ,
	|	СтатьиПланаПоступленийВыбытий.ВидДоходаКДБ,
	|	СтатьиПланаПоступленийВыбытий.ГруппаПодвидаКДБ,
	|	СтатьиПланаПоступленийВыбытий.АналитическаяГруппаКДБ,
	|	СтатьиПланаПоступленийВыбытий.ГруппаПодгруппаКИФ,
	|	СтатьиПланаПоступленийВыбытий.СтатьяКИФ,
	|	СтатьиПланаПоступленийВыбытий.ВидКИФ,
	|	СтатьиПланаПоступленийВыбытий.АналитическаяГруппаКИФ,
	|	СтатьиПланаПоступленийВыбытий.АналитическийКодКПС,
	|	СтатьиПланаПоступленийВыбытий.Владелец.ВидПоказателя КАК ВидПоказателя,
	|	СтатьиПланаПоступленийВыбытий.Владелец.УточнениеПоказателя КАК УточнениеПоказателя,
	|	ПОДСТРОКА(СтатьиПланаПоступленийВыбытий.Код, 1, 17) КАК Код,
	|	СтатьиПланаПоступленийВыбытий.ДатаНачалаДействия,
	|	СтатьиПланаПоступленийВыбытий.ДатаОкончанияДействия,
	|	СтатьиПланаПоступленийВыбытий.Владелец.Бюджет КАК Бюджет
	|ИЗ
	|	Справочник.СтатьиПланаПоступленийВыбытий КАК СтатьиПланаПоступленийВыбытий
	|ГДЕ
	|	СтатьиПланаПоступленийВыбытий.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", СтатьяПлана);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		
		ВидБК = Неопределено;
		Бюджет = Неопределено;
		УточнениеБК = Неопределено;
		
		Возврат Новый ФиксированнаяСтруктура();
		
	КонецЕсли;
	
	ВидБК 	= Выборка.ВидПоказателя;
	Бюджет 	= Выборка.Бюджет;
	УточнениеБК = Выборка.УточнениеПоказателя;
	
	СтруктураБК = СтруктураПоказателя(ВидБК, УточнениеБК);
	
	Если СтруктураБК = Неопределено Тогда
		
		ВидБК = Неопределено;
		Бюджет = Неопределено;
		
		Возврат Новый ФиксированнаяСтруктура();

	КонецЕсли;  
	
	ЗаполнитьЗначенияСвойств(СтруктураБК, Выборка);
    	
	Возврат Новый ФиксированнаяСтруктура(СтруктураБК);
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОпределитьПериодДействияСтатьиПоКомпонентам(ТаблицаКомпонентов, ДатаНачала = Неопределено, ДатаОкончания = Неопределено)
	
	ТекДатаНачала    = ?(ДатаНачала = Неопределено, '00010101', ДатаНачала) ;
	ТекДатаОкончания = '29990101';
	
	ЕстьКомпонентыСоСрокомДействия = Ложь;
	
	Для Каждого Компонент Из ТаблицаКомпонентов Цикл 
		
		Если ЗначениеЗаполнено(Компонент.Значение) И ОбщегоНазначения.ЗначениеСсылочногоТипа(Компонент.Значение) Тогда
			
			Если НЕ Компонент.Значение.Метаданные().Реквизиты.Найти("ОкончаниеДействия") = Неопределено Тогда
				
				ТекДатаНачала    = Макс(ТекДатаНачала,    Компонент.Значение.ДатаНачалаДействия);
				ТекДатаОкончания = Мин (ТекДатаОкончания, Компонент.Значение.ДатаОкончанияДействия);
				
				ЕстьКомпонентыСоСрокомДействия = Истина;

			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если ЕстьКомпонентыСоСрокомДействия Тогда
		
		ДатаНачала 		= ТекДатаНачала;
		
		Если ДатаОкончания = Неопределено Тогда
			ДатаОкончания = ТекДатаОкончания;
		Иначе	
			ДатаОкончания 	= ?(ТекДатаОкончания = '29990101', Макс(ДатаОкончания, ДатаНачала) , Макс(Мин(ТекДатаОкончания, ДатаОкончания), ДатаНачала));
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ВычислитьНовоеНаименование(ЧастиКода, МассивИмен, ВидСтатьи)
	
	НовоеНаименование = "";       
	
	Если ЧастиКода.Количество() > 0 Тогда
		
		Если МассивИмен.Количество() = 0 Тогда
			
			Спр = ЧастиКода[ЧастиКода.Количество() - 1].Значение;
			
			Если ЗначениеЗаполнено(Спр) Тогда
				НовоеНаименование = Спр.НаименованиеПолное;
			КонецЕсли;
			
		ИначеЕсли ВидСтатьи = Перечисления.ВидыКБК.КДБ И ТипЗнч(ЧастиКода[0].Значение) = Тип("СправочникСсылка.ВидыДоходовКДБ") Тогда 
			
			НовоеНаименование = НаименованиеДохода2016(ЧастиКода);
			
		ИначеЕсли ВидСтатьи = Перечисления.ВидыКБК.КИФ Тогда
			
			НовоеНаименование = НаименованиеКИФ(ЧастиКода);
			
		Иначе
			ТипСсылкаКОСГУ = Тип("СправочникСсылка.КОСГУ");
			Для Каждого Инд Из МассивИмен Цикл
				Спр = ЧастиКода[Инд].Значение;
				Если ЗначениеЗаполнено(Спр) Тогда
					Если ТипЗнч(Спр) = ТипСсылкаКОСГУ
						И ВидСтатьи = Перечисления.ВидыКБК.АУИБУ Тогда
						//это ан.группа
						НовоеНаименование = БюджетнаяКлассификация.НаименованиеАнГруппыПоСсылке(Спр);
					Иначе
						НовоеНаименование = Спр.НаименованиеПолное;	
					КонецЕсли;					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НовоеНаименование;
	
КонецФункции	

Функция НаименованиеДохода2016(ЧастиКода)
	
	ВидДохода 			= ЧастиКода[0].Значение;
	АналитическаяГруппа = Неопределено;
	
	НаименованиеВида = "";
	
	Если ЧастиКода.Количество() > 2 Тогда 
		АналитическаяГруппа = ЧастиКода[2].Значение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АналитическаяГруппа) Тогда
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ВидыДоходовКДБАналитическиеГруппы.Наименование КАК НаименованиеАнГруппы,
		|	ВидыДоходовКДБАналитическиеГруппы.Ссылка.НаименованиеПолное КАК НаименованиеВида
		|ИЗ
		|	Справочник.ВидыДоходовКДБ.АналитическиеГруппы КАК ВидыДоходовКДБАналитическиеГруппы
		|ГДЕ
		|	ВидыДоходовКДБАналитическиеГруппы.Ссылка = &Ссылка
		|	И ВидыДоходовКДБАналитическиеГруппы.АналитическаяГруппа = &АналитическаяГруппа");
		
		Запрос.УстановитьПараметр("АналитическаяГруппа", АналитическаяГруппа);
		Запрос.УстановитьПараметр("Ссылка", ВидДохода);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Если ЗначениеЗаполнено(Выборка.НаименованиеАнГруппы) Тогда
				НаименованиеВида = Выборка.НаименованиеАнГруппы;
			Иначе
				НаименованиеВида = Выборка.НаименованиеВида;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(ВидДохода) Тогда
			НаименованиеВида = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "НаименованиеПолное");
		КонецЕсли;
		
	КонецЕсли;
	
	//добавляем наименование группы подвида
	//
	Если ЧастиКода.Количество() > 1 И ЗначениеЗаполнено(ЧастиКода[1].Значение) Тогда
		Если ЗначениеЗаполнено(НаименованиеВида) И НЕ Прав(НаименованиеВида, 1) = " " Тогда	
			НаименованиеВида = НаименованиеВида + " ";
		КонецЕсли;	
		НаименованиеВида = НаименованиеВида + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЧастиКода[1].Значение, "НаименованиеПолное");
	КонецЕсли;
	
	//указано только аналитическая группа
	//
	Если НЕ ЗначениеЗаполнено(НаименованиеВида) 
		И ЗначениеЗаполнено(АналитическаяГруппа) Тогда
		РеквизитыАнГруппы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(АналитическаяГруппа, "Код,НаименованиеПолное");
		
		НаименованиеВида = БюджетнаяКлассификация.ПолучитьНаименованиеАнГруппы(РеквизитыАнГруппы.Код,РеквизитыАнГруппы.НаименованиеПолное);
	КонецЕсли;

	//добавляем наименование КОСГУ
	//
	Если ЧастиКода.Количество() > 3 И ЗначениеЗаполнено(ЧастиКода[3].Значение) Тогда
		Если ЗначениеЗаполнено(НаименованиеВида) И НЕ Прав(НаименованиеВида, 1) = " " Тогда	
			НаименованиеВида = НаименованиеВида + " ";
		КонецЕсли;	
		НаименованиеВида = НаименованиеВида + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЧастиКода[3].Значение, "НаименованиеПолное");
	КонецЕсли;
	
	Возврат НаименованиеВида; 
	
КонецФункции	

Функция НаименованиеКИФ(ЧастиКода)
	
	Группа = Неопределено;
	Статья = Неопределено;
	Вид = Неопределено;
	АналитическаяГруппа = Неопределено;
	
	Если ЧастиКода.Количество() > 0 Тогда 
		Группа = ЧастиКода[0].Значение;
	КонецЕсли;
	
	Если ЧастиКода.Количество() > 1 Тогда 
		Статья = ЧастиКода[1].Значение;
	КонецЕсли;
	
	Если ЧастиКода.Количество() > 2 Тогда 
		Вид = ЧастиКода[2].Значение;
	КонецЕсли;
	
	Если ЧастиКода.Количество() > 3 Тогда 
		АналитическаяГруппа = ЧастиКода[3].Значение;
	КонецЕсли;
			
	СтрокаНаименования = "";

	Если ЗначениеЗаполнено(Вид) Тогда
		СтрокаНаименования =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Вид,"НаименованиеПолное");
	ИначеЕсли ЗначениеЗаполнено(Статья) Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Запрос.НаименованиеПолное
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДопустимыеКОСГУ.Наименование КАК НаименованиеПолное,
		|		1 КАК Приоритет
		|	ИЗ
		|		Справочник.СтатьиКИФ.ДопустимыеКОСГУ КАК ДопустимыеКОСГУ
		|	ГДЕ
		|		ДопустимыеКОСГУ.Ссылка = &Ссылка
		|		И ДопустимыеКОСГУ.КОСГУ = &АналитическаяГруппа
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Спр.НаименованиеПолное,
		|		2
		|	ИЗ
		|		Справочник.СтатьиКИФ КАК Спр
		|	ГДЕ
		|		Спр.Ссылка = &Ссылка) КАК Запрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	Запрос.Приоритет";
		
		Запрос.УстановитьПараметр("Ссылка",Статья);
		Запрос.УстановитьПараметр("АналитическаяГруппа" ,АналитическаяГруппа);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтрокаНаименования = Выборка.НаименованиеПолное;
		Иначе
			СтрокаНаименования = "";
		КонецЕсли;
			
	ИначеЕсли ЗначениеЗаполнено(Группа) Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Запрос.НаименованиеПолное
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДопустимыеКОСГУ.Наименование КАК НаименованиеПолное,
		|		1 КАК Приоритет
		|	ИЗ
		|		Справочник.ГруппыПодгруппыКИФ.ДопустимыеКОСГУ КАК ДопустимыеКОСГУ
		|	ГДЕ
		|		ДопустимыеКОСГУ.Ссылка = &Ссылка
		|		И ДопустимыеКОСГУ.КОСГУ = &КОСГУ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Спр.НаименованиеПолное,
		|		2
		|	ИЗ
		|		Справочник.ГруппыПодгруппыКИФ КАК Спр
		|	ГДЕ
		|		Спр.Ссылка = &Ссылка) КАК Запрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	Запрос.Приоритет";
		
		Запрос.УстановитьПараметр("Ссылка",Группа);
		Запрос.УстановитьПараметр("АналитическаяГруппа",АналитическаяГруппа);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтрокаНаименования = Выборка.НаименованиеПолное;
		Иначе
			СтрокаНаименования = "";
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(АналитическаяГруппа) Тогда
		
		СтрокаНаименования = БюджетнаяКлассификация.НаименованиеАнГруппыПоСсылке(АналитическаяГруппа);
			
	КонецЕсли;

	Если ЗначениеЗаполнено(Вид)
		И ЗначениеЗаполнено(АналитическаяГруппа)
		И ЗначениеЗаполнено(СтрокаНаименования) Тогда
		
		//Если в наименовании есть символы " %%% ", то считаем, что это 2 разных наименования, для разных ан.групп:
	    //01 01 0000 02 0001 710 - Какое-то первое наименование ...
		//01 01 0000 02 0001 810 - Какое-то совсем другое наименование ...
		
		ПозицияРазделителя = СтрНайти(СтрокаНаименования," %%% ");
		
		Если ПозицияРазделителя>0 Тогда
		    ПерваяЧасть = Лев(СтрокаНаименования,ПозицияРазделителя-1);
		    ВтораяЧасть = Сред(СтрокаНаименования,ПозицияРазделителя+5);
		    
		    ПервыйСимволАнГруппы = Лев(АналитическаяГруппа,1);
			Если ПервыйСимволАнГруппы = "5"
				ИЛИ ПервыйСимволАнГруппы = "7" Тогда
				СтрокаНаименования = ПерваяЧасть;
			ИначеЕсли ПервыйСимволАнГруппы = "6"
				ИЛИ ПервыйСимволАнГруппы = "8" Тогда
			    СтрокаНаименования = ВтораяЧасть;
			КонецЕсли;
		Иначе
		
			//Если заполнен Вид, то наименование определяется из полного наименования Вида КИФ.
			//Может требоваться разное наименование для разных ан.групп (переменная КОСГУ),
			//например:
			//01 01 0000 02 0001 710 - Размещение государственных облигаций ...
			//01 01 0000 02 0001 810 - Погашение государственных облигаций ...
			//Т.к. наименование для Вида одно, то добавлена следующая возможность:
			//Если наименование Вида заданов формате "А/Б прочий текст", 
			//то в зависимости от ан.группы, А/Б меняется на А или Б.
			//Для ан.группы 5хх, 7хх берется А, для 6хх, 8хх, берется Б.
			//
			//Пример наименования вида: "Размещение/погашение государственных облигаций..."
			//
			//Принцип работы:
			//берем символы наименования Вида до первого пробела, 
			//если в них есть символ "/" и он один, то заменяем по описанному выше варианту.
						
			ПервыйПробел = СтрНайти(СтрокаНаименования," ");
			Если ПервыйПробел <> 0 Тогда
				ПерваяФраза = Лев(СтрокаНаименования,ПервыйПробел-1);
				МассивСлов = СтрРазделить(ПерваяФраза,"/",Ложь);
				Если МассивСлов.Количество() = 2 Тогда
					ПервыйСимволАнГруппы = Лев(АналитическаяГруппа,1);
					Если ПервыйСимволАнГруппы = "5"
						ИЛИ ПервыйСимволАнГруппы = "7" Тогда
						СтрокаНаименования = МассивСлов[0] + Сред(СтрокаНаименования,ПервыйПробел);
					ИначеЕсли ПервыйСимволАнГруппы = "6"
						ИЛИ ПервыйСимволАнГруппы = "8" Тогда
					    СтрокаНаименования = Врег(Лев(МассивСлов[1],1))+Сред(МассивСлов[1],2) + Сред(СтрокаНаименования,ПервыйПробел);
					КонецЕсли;
				КонецЕсли;
					
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрокаНаименования;
	
КонецФункции

#КонецОбласти
